{
  "results": [
    {
      "name": "Ada Lovelace",
      "image": "ada-lovelace.jpg",
      "headline": "A gifted mathematician, Ada Lovelace is considered to have written instructions for the first computer program in the mid-1800s.",
      "body": "Lovelace's immersion in both fields began with her parents: Romanticism's playboy poet Lord Byron and his \"Princess of the Parallelogram,\" a prim and proper product of the Industrial Revolution named Annabella Milbanke. As hinted by Lord Bryon arriving several days late to his own wedding, their marriage would not last. Although divorce was heavily stigmatized in England's Regency Era, Byron's incest with his half sister was even more taboo. Lovelace, then just four months old, would never know her father.Fearing that her daughter might inherit Lord Byron's manic tendencies, Annabella imposed on Ada a strict diet of mathematics and science. Lovelace's tutors believed that,had she been a man,there would have been \"potential to become an original mathematical investigator, perhaps of first-rate eminence.\" Indeed, Ada's processing power was reportedly so great she suffered from headaches that impaired her vision.Although many men of the time feared \"the very great tension of mind which [sophisticated mathematics] requires is beyond a woman's physical power,\" Lovelace viewed things differently, writing: \"Nothing but a very close and intense application to subjects of a scientific nature now seems at all to keep my imagination from running wild, or to stop the voice which seems to be left in my mind.\"At 17,Lovelace became friends with inventor and father of the computer,Charles Babbage.Babbage was best knownfor designing the difference engine,a computer meant to perform mathematical calculations.He also designed its successor,the analytical engine which was supposed to carry out more complex calculations.At 19,marriage led to three children in four years.At 26, encouraged by her husband, Lovelace returned to assisting her friend and mentor Charles Babbage,known as the father of the computer. Over time, Babbage became so impressed with Lovelace 's analytical skills that he called her the \"Enchantress of Number.\" He later asked Lovelace to translate an article written by an Italian mathematician about the analytical engine from French to English. While translating the article, she added her own notes describing how to write code for the device to handle letters, symbols and numbers. \"The Analytical Engine has no pretentions whatever to originate anything,\" she wrote in one of those footnotes. \"It can do whatever we know how to order it to perform. It can follow analysis; but it has no power of anticipating any analytical relations or truths. Its province is to assist us in making available what we are already acquainted with.\" Thanks to those notes on the engine, Lovelace is now widely recognized as the first computer programmer. Ada Lovelace is considered to be the founder of scientific computing and the first computer programmer.Her algorithm - which history has come to know as the first one designed for a machine to carry out.Lovelace would sadly not see built during her lifetime.Lovelace passed away in 1852, but her previously little - known work and \"poetical\" approach to science has broken through to inspire present-day young women interested in computer programming. Although she earned little public recognition during her lifetime, Ada Lovelace is now considered a pioneer and prophet of the computer age.In the first entry to his book Innovators, Walter Isaacson wrote: \"Like Steve Jobs, [Ada Lovelace] stands at the intersection of arts and technology.\" Today, Lovelace 's legacy lives on as the world's first computer programmer.Her work with Babbage and her mathematical mind not only gave us the first language of code, but also the method of looping, which is a series of instructions that continually repeats until a certain condition is reached.The looping process is still in use by programmers today.",
      "STEM-ID": {
        "id": "2",
        "name": "Technology"
      },
      "moreInfo": [
        "https://en.wikipedia.org/wiki/Ada_Lovelace",
        "http://www.history.com/news/10-things-you-may-not-know-about-ada-lovelace"
      ]
    },
    {
      "name": "Ana Roque de Duprey",
      "image": "anadupreyphoto_square.jpg",
      "headline": "First Puerto Rican woman to become member of the Public Library",
      "body": "Ana Roqué de Duprey was born in Puerto Rico in 1853. She started a school in her home at age 13 and wrote a geography textbook for her students, which was later adopted by the Department of Education of Puerto Rico. Roqué had a passion for astronomy and education, founding several girls-only schools as well as the College of Mayagüez, which later became the Mayagüez Campus of the University of Puerto Rico. Roqué wrote the Botany of the Antilles, the most comprehensive study of flora in the Caribbean at the beginning of the 20th century, and was also instrumental in the fight for the Puerto Rican woman's right to vote.",
      "STEM-ID": {
        "id": "1",
        "name": "Science"
      },
      "moreInfo": [
        "http://www.latinorebels.com/2015/09/21/the-feminist-flower/",
        "https://en.wikipedia.org/wiki/Ana_Roque_de_Duprey"
      ]
    },
    {
      "name": "Carol Shaw",
      "image": "carol_shaw.jpg",
      "headline": "Atari Game Developer",
      "body": "Carol Shaw was born and raised in Palo Alto, CA. Always excellent at math, it wasn't until she inherited her brothers' model railroad that Shaw began tinkering with electronics: \"I actually designed some circuitry … with some transistors and stuff that would turn on the signal light for various blocks showing there was a train up ahead.\" Fresh out of Berkeley's Computer Science graduate program, Shaw accepted a position at game-maker Atari in the late 1970s. Wearing thick-rimmed glasses and flannel, she biked 10 miles each way to design and program video games.Eventually landing at Activision, Shaw programmed one of the Atari's best-known shooter games, River Raid. For the first time, gamers could experience an inordinate amount of non-random, repeating terrain despite constrictive memory limits. River Raid was the first game that allowed the shooter to accelerate and slow down all over the screen. Shaw's work as a pioneer game designer has made her a legend to two generations of tech pros and gamers.",
      "STEM-ID": {
        "id": "2",
        "name": "Technology"
      },
      "moreInfo": [
        "https://en.wikipedia.org/wiki/Carol_Shaw",
        "http://www.vintagecomputing.com/index.php/archives/800/vcg-interview-carol-shaw-female-video-game-pioneer-2"
      ]
    },
    {
      "name": "Evelyn Boyd Granville",
      "image": "Evelyn_Boyd_Granville.jpg",
      "headline": "Race, Space, & Education Advocacy",
      "body": "Growing up in Washington, D.C. during the Great Depression, Evelyne Boyd Granville perpetually saw her glass as half-full. \"I was aware that segregation placed many limitations on Negros,\" she wrote. \"However, daily one came into contact with Negroes who had made a place for themselves in society…\" Granville's daily contact with such role models began at Dunbar High School, where highly educated teachers (white and black) instilled a belief in Granville that, regardless of race and gender, all deserved access to knowledge. \"We accepted education as the means to rise above the limitations that a prejudiced society endeavored to place upon us.\" Pinched pennies, financial aid, and academic scholarship made her continued education possible. Granville attended Smith College and then Yale for her Ph.D, becoming just the second African American women to receive a mathematics doctorate at any American University. After a few years of teaching at Fisk University, an all-black college in Nashville, Granville began her professional career performing real-time' calculations for satellite launchings. She studied rocket trajectories and methods of orbit computation as a part of the U.S. involvement in the space race. In 1967, Granville returned to the classroom, where she began an impressive 30-year commitment to education advocacy.",
      "STEM-ID": {
        "id": "4",
        "name": "Mathematics"
      },
      "moreInfo": [
        "https://en.wikipedia.org/wiki/Evelyn_Boyd_Granville",
        "https://www.biography.com/people/evelyn-boyd-granville-21442045"
      ]
    },
    {
      "name": "Janese Swanson",
      "image": "JaneseSwanson.jpg",
      "headline": "Founder of Girl Tech",
      "body": "Easy was never an option for Janese Swanson. After her father died in Vietnam, she began helping her mother clean houses for extra cash. One day, while cleaning a wealthy doctor's home in La Jolla, CA, Swanson shared a dream of becoming a doctor herself. The doctor's wife advised: \"It will be easier for you if you marry a doctor.\" At age 15, she fibbed her date of birth and started slinging televisions at Sears. Many years later, Swanson would use her electronic sales experience as manager of the computer and technology department at a small store called My Child's Destiny. Interested in the nexus of technology and children education, she received Computers in Education Certificate from Berkeley, all while raising her daughter. In 1988, Swanson began working for Broderbund Software Company, developing games for kids such as, \"Where in the World is Carmen Sandiego?\" However, she struggled there as \"[we women] earned far less than there male colleagues… had to raise hands to get a word in [at meetings] … and always had a hard time getting men to focus on what we were saying rather than our legs and breasts.\" She quit, got her Ph.D from San Francisco State, and, in 1995, started her own toy company, Girl Tech. Swanson initially struggled to find investors and vendors. \"For two years after I founded the company, toy store buyers would say, 'Can you make it pink' [or] 'Can you make it for boys?' And I would say, 'No, this is what girls like to play with.'\" It wasn't easy but, in 1998, Swanson sold Girl Tech to Radica Games Limited for $6 million. She remained with the company for 2 years as Vice President",
      "STEM-ID": {
        "id": "2",
        "name": "Technology"
      },
      "moreInfo": [
        "https://en.wikipedia.org/wiki/Janese_Swanson",
        "https://speakerpedia.com/speakers/janese-swanson"
      ]
    },
    {
      "name": "Lillian Gilbreth",
      "image": "lillianmollergilbraith_square.jpg",
      "headline": "The role model for the highly intelligent, quirky mother in the popular movie Cheaper by the Dozen",
      "body": "Lillian Moller Gilbreth was an American psychologist and industrial engineer at the turn of the 20th century. She was an expert in efficiency and organizational psychology, the principles of which she applied not only as a management consultant for major corporations, but also to her household of twelve children, as chronicled in the book Cheaper by the Dozen. Her long list of firsts includes first female commencement speaker at the University of California, first female engineering professor at Purdue, and first woman elected to the National Academy of Engineering.",
      "STEM-ID": {
        "id": "3",
        "name": "Engineering"
      },
      "moreInfo": [
        "https://en.wikipedia.org/wiki/Lillian_Moller_Gilbreth",
        "https://www.asme.org/career-education/articles/management-professional-practice/lillian-moller-gilbreth"
      ]
    },
    {
      "name": "Sister Mary Kenneth Keller",
      "image": "mary_kenneth_keller.jpg",
      "headline": "First Female Computer Science Phd",
      "body": "The first woman to receive a Ph.D in Computer Science was a nun: Mary Kenneth Keller entered the \"Sister of Charity\" in 1932, professing her vows in 1940. Keller received her B.S./M.S. Mathematics from DePaul University in Chicago and briefly studied at Dartmouth, breaking the \"men-only\" rule. While there, Keller played a significant role developing a key computer language: Beginner's All-Puprose Symbolic Instruction Code, or BASIC. Keller understood that the world was \"having an information explosion… and information is of no use unless it's available.\" Thanks to BASIC, writing custom software was no longer restricted to mathematicians and scientists. Her contribution made computer use much more accessible to a broader portion of the population.Keller returned to the Midwest and, in 1965, received her PhD from the University of Wisconsin. Clarke College in Dubuque, Iowa hired Keller to create and chair their Computer Science Department, where she continued to grow and share her knowledge for 20 years",
      "STEM-ID": {
        "id": "2",
        "name": "Technology"
      },
      "moreInfo": [
        "https://en.wikipedia.org/wiki/Mary_Kenneth_Keller",
        "http://mentalfloss.com/article/53178/first-woman-earn-phd-computer-science-was-nun"
      ]
    },
    {
      "name": "Susan Kare",
      "image": "susan_kare.jpg",
      "headline": "The Apple Icon",
      "body": "Although our next pioneer briefly worked for Microsoft, Susan Kare is best known for her work with Bill Gate's nemesis, Steve Jobs. Kare followed dreams of a career in the fine arts to San Francisco. A chance encounter with an old high school friend landed her an interview with Apple. Steve Jobs, inspired by Xerox's graphical user interface (GUI), was on the hunt for an artist who could design Macintosh's icons. She got the job. \"The morale is to have confidence in your skill mix,\" she later said. \"Because I certainly didn't have a computer background.\" Using a pad of graph paper, Kare designed icons that were simple, elegant, and playful. The original designs were just 32 x 32 pixels. Kare is also responsible for developing the command (\"Apple\") key as a stylized castle seen from above. As part of her Apple work, Kare created the typeface Chicago, used in the first four generations of the iPod. To keep the lettering smooth and seamless, all lines were purposefully made horizontal, vertical, or on a 45-degree angle. That sort of attention to detail has continued to define Apple to this day.",
      "STEM-ID": {
        "id": "2",
        "name": "Technology"
      },
      "moreInfo": [
        "https://en.wikipedia.org/wiki/Susan_Kare",
        "http://www.computinghistory.org.uk/det/1792/Susan-Kare/"
      ]
    }
  ]
}
